#!/bin/bash

# компілюємо код в об'єктний файл
# -o куди запитати результат
# -c задає зробити лише компіляцію, але не робити збірку (linking)
# -O3 оптимізація 3-го рівня
# -fPIC щоб зробити position independent code (потрібно для динамічних бібліотек, що автоматично один раз завантажуються в пам'ять)
g++ -O3 -fPIC -c -o Lukich_lib.o Lukich_lib.cpp

# робимо з об'єктного файлу Lukich_lib.o динамічну (опція -shared) бібліотеку libLukich_lib.so (імена бібліотек мають починатися з lib)
g++ -shared -o libLukich_lib.so Lukich_lib.o 

# компілюємо код головної програми в об'єктний файл
g++ -o Lukich_main.o -c Lukich_main.cpp 

# збираємо головну програму і бібліотеку в кінцевий бінарник Lukich_main
# -l задає ім'я потрібної бібліотеки (може бути декілька бібліотек, їхні імена наводяться без lib і без розширення)
# -L задає шляхи до бібліотек (. це поточна директорія)
g++ -o Lukich_main -l Lukich_lib -L . Lukich_main.o

# просто подивимося, з якими бібліотеками злінкований наш бінарник Lukich_main: має показати libLukich_lib.so
ldd Lukich_main

# запускаємо основну програму
./Lukich_main
